#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-rwGNjbtKTUYPWzNW

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.quarkus_microprofile: Refreshing state... [id=quarkus-microprofile]
github_repository.quarkus_logging_json: Refreshing state... [id=quarkus-logging-json]
github_repository.quarkus_google_cloud_services: Refreshing state... [id=quarkus-google-cloud-services]
github_repository.quarkus_hibernate_types: Refreshing state... [id=quarkus-hibernate-types]
github_repository.quarkus_neo4j: Refreshing state... [id=quarkus-neo4j]
github_repository.quarkus_datadog_opentracing: Refreshing state... [id=quarkus-datadog-opentracing]
github_repository.quarkus_jjwt_jackson: Refreshing state... [id=quarkus-jjwt-jackson]
github_repository.quarkus_logging_cloudwatch: Refreshing state... [id=quarkus-logging-cloudwatch]
github_repository.quarkus_logging_manager: Refreshing state... [id=quarkus-logging-manager]
github_repository.quarkus_scala: Refreshing state... [id=quarkus-scala3]
github_repository.quarkus_vault: Refreshing state... [id=quarkus-vault]
github_repository.quarkus_logging_splunk: Refreshing state... [id=quarkus-logging-splunk]
github_repository.quarkus_jberet: Refreshing state... [id=quarkus-jberet]
github_repository.quarkus_freemarker: Refreshing state... [id=quarkus-freemarker]
github_repository.quarkus_reactive_messaging_http: Refreshing state... [id=quarkus-reactive-messaging-http]
github_repository.quarkus_hivemq_client: Refreshing state... [id=quarkus-hivemq-client]
github_repository.quarkus_operator_sdk: Refreshing state... [id=quarkus-operator-sdk]
github_repository.quarkus_logging_logback: Refreshing state... [id=quarkus-logging-logback]
github_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=quarkus-shardingsphere-jdbc]
github_repository.quarkus_tika: Refreshing state... [id=quarkus-tika]
github_repository.quarkus_unleash: Refreshing state... [id=quarkus-unleash]
github_repository.quarkus_kerberos: Refreshing state... [id=quarkus-kerberos]
github_repository.quarkus_amazon_services: Refreshing state... [id=quarkus-amazon-services]
github_repository.quarkus_mockk: Refreshing state... [id=quarkus-mockk]
github_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_repository.quarkus_github_app: Refreshing state... [id=quarkus-github-app]
github_repository.quarkus_jgrapht: Refreshing state... [id=quarkus-jgrapht]
github_repository.quarkus_jna: Refreshing state... [id=quarkus-jna]
github_repository.quarkus_univocity_parsers: Refreshing state... [id=quarkus-univocity-parsers]
github_repository.quarkus_zeebe: Refreshing state... [id=quarkus-zeebe]
github_repository.quarkus_prettytime: Refreshing state... [id=quarkus-prettytime]
github_repository.quarkus_jgit: Refreshing state... [id=quarkus-jgit]
github_repository.quarkus_xmlsec: Refreshing state... [id=quarkus-xmlsec]
github_repository.quarkus_morphia: Refreshing state... [id=quarkus-morphia]
github_repository.quarkus_minio: Refreshing state... [id=quarkus-minio]
github_repository.quarkus_tekton_client: Refreshing state... [id=quarkus-tekton-client]
github_repository.quarkus_rsocket: Refreshing state... [id=quarkus-rsocket]
github_repository.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_repository.quarkus_jsch: Refreshing state... [id=quarkus-jsch]
github_repository.quarkus_artemis: Refreshing state... [id=quarkus-artemis]
github_repository.quarkus_consul_config: Refreshing state... [id=quarkus-consul-config]
github_repository.quarkus_maven_resolver: Refreshing state... [id=quarkus-maven-resolver]
github_repository.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_repository.quarkus_doma: Refreshing state... [id=quarkus-doma]
github_repository.quarkus_micrometer_registry: Refreshing state... [id=quarkus-micrometer-registry]
github_repository.quarkus_jooq: Refreshing state... [id=quarkus-jooq]
github_repository.quarkus_logging_sentry: Refreshing state... [id=quarkus-logging-sentry]
github_repository.quarkus_lucene: Refreshing state... [id=quarkus-lucene]
github_repository.quarkus_opencv: Refreshing state... [id=quarkus-opencv]
github_repository.quarkus_amazon_alexa: Refreshing state... [id=quarkus-amazon-alexa]
github_repository.quarkus_github_api: Refreshing state... [id=quarkus-github-api]
github_repository.quarkus_rabbitmq_client: Refreshing state... [id=quarkus-rabbitmq-client]
github_repository.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_repository.quarkus_jackson_jq: Refreshing state... [id=quarkus-jackson-jq]
github_repository.quarkus_qson: Refreshing state... [id=quarkus-qson]
github_repository.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_repository.quarkus_mybatis: Refreshing state... [id=quarkus-mybatis]
github_repository_collaborator.quarkus_google_cloud_services["dzou"]: Refreshing state... [id=quarkus-google-cloud-services:dzou]
github_repository_collaborator.quarkus_jberet["aureamunoz"]: Refreshing state... [id=quarkus-jberet:aureamunoz]
github_branch.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive:main]
github_repository_collaborator.quarkus_github_app["yrodiere"]: Refreshing state... [id=quarkus-github-app:yrodiere]
github_branch.quarkus_jgit: Refreshing state... [id=quarkus-jgit:main]
github_branch.quarkus_cxf: Refreshing state... [id=quarkus-cxf:master]
github_branch.quarkus_jsch: Refreshing state... [id=quarkus-jsch:main]
github_branch.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client:master]
github_team.quarkus_doma: Refreshing state... [id=4206574]
github_team.quarkus_logging_cloudwatch: Refreshing state... [id=4766806]
github_team.quarkus_scala: Refreshing state... [id=4973599]
github_team.quarkus_lucene: Refreshing state... [id=4572442]
github_team.quarkus_rsocket: Refreshing state... [id=4628116]
github_team.quarkus_mybatis: Refreshing state... [id=4163389]
github_team.quarkus_hivemq_client: Refreshing state... [id=4651319]
github_team.quarkus_jjwt_jackson: Refreshing state... [id=4698127]
github_team.quarkus_reactive_messaging_http: Refreshing state... [id=5290863]
github_team.quarkus_jsch: Refreshing state... [id=5418783]
github_team.quarkus_unleash: Refreshing state... [id=4478763]
github_team.quarkus_apicurio_registry_client: Refreshing state... [id=4359832]
github_team.quarkus_vault: Refreshing state... [id=5438750]
github_team.quarkus_jgrapht: Refreshing state... [id=4691584]
github_team.quarkus_maven_resolver: Refreshing state... [id=5330694]
github_team.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463]
github_team.quarkus_mockk: Refreshing state... [id=4479092]
github_team.quarkus_micrometer_registry: Refreshing state... [id=4331393]
github_team.quarkus_xmlsec: Refreshing state... [id=5249540]
github_team.quarkus_neo4j: Refreshing state... [id=5438745]
github_team.quarkus_qson: Refreshing state... [id=5258394]
github_team.quarkus_logging_json: Refreshing state... [id=4136031]
github_team.quarkus_operator_sdk: Refreshing state... [id=4585468]
github_team.quarkus_minio: Refreshing state... [id=4257600]
github_team.quarkus_freemarker: Refreshing state... [id=4139356]
github_team.quarkus_logging_manager: Refreshing state... [id=4193789]
github_team.quarkus_cxf: Refreshing state... [id=4221025]
github_team.quarkus_jgit: Refreshing state... [id=5418782]
github_team.quarkus_datadog_opentracing: Refreshing state... [id=4759562]
github_team.quarkus_microprofile: Refreshing state... [id=5018652]
github_team.quarkus_cucumber: Refreshing state... [id=5020733]
github_team.quarkus_logging_sentry: Refreshing state... [id=5300000]
github_team.quarkus_jberet: Refreshing state... [id=4130738]
github_team.quarkus_hibernate_types: Refreshing state... [id=4427586]
github_team.quarkus_jackson_jq: Refreshing state... [id=5182252]
github_team.quarkus_tekton_client: Refreshing state... [id=4429729]
github_team.quarkus_consul_config: Refreshing state... [id=5438744]
github_team.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628]
github_team.quarkus_google_cloud_services: Refreshing state... [id=4133757]
github_team.quarkus_amazon_services: Refreshing state... [id=5438747]
github_team.quarkus_amazon_alexa: Refreshing state... [id=5438751]
github_team.quarkus_config_extensions: Refreshing state... [id=4679791]
github_team.quarkus_jooq: Refreshing state... [id=4499064]
github_team.quarkus_logging_logback: Refreshing state... [id=4934360]
github_team.quarkus_opencv: Refreshing state... [id=5330519]
github_team.quarkus_kerberos: Refreshing state... [id=5330599]
github_team.quarkus_zeebe: Refreshing state... [id=5333665]
github_team.quarkus_rabbitmq_client: Refreshing state... [id=4454281]
github_team.quarkus_tika: Refreshing state... [id=5317008]
github_team.quarkus_morphia: Refreshing state... [id=4994632]
github_team.quarkus_github_api: Refreshing state... [id=5327486]
github_team.quarkus_logging_splunk: Refreshing state... [id=4611522]
github_team.quarkus_univocity_parsers: Refreshing state... [id=4707008]
github_team.quarkus_github_app: Refreshing state... [id=5327479]
github_team.quarkus_jna: Refreshing state... [id=4257639]
github_team.quarkus_prettytime: Refreshing state... [id=4612233]
github_team.quarkus_artemis: Refreshing state... [id=5438742]
github_app_installation_repository.quarkus_rabbitmq_client["20894091"]: Refreshing state... [id=20894091:quarkus-rabbitmq-client]
github_branch.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber:main]
github_branch.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions:main]
github_branch_default.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_branch_default.quarkus_jgit: Refreshing state... [id=quarkus-jgit]
github_branch_default.quarkus_jsch: Refreshing state... [id=quarkus-jsch]
github_branch_default.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_team_membership.quarkus_doma["nakamura-to"]: Refreshing state... [id=4206574:nakamura-to]
github_team_repository.quarkus_doma: Refreshing state... [id=4206574:quarkus-doma]
github_team_membership.quarkus_logging_cloudwatch["pilhuhn"]: Refreshing state... [id=4766806:pilhuhn]
github_team_repository.quarkus_logging_cloudwatch: Refreshing state... [id=4766806:quarkus-logging-cloudwatch]
github_team_membership.quarkus_logging_cloudwatch["bennetelli"]: Refreshing state... [id=4766806:bennetelli]
github_team_membership.quarkus_scala["GavinRay97"]: Refreshing state... [id=4973599:GavinRay97]
github_team_repository.quarkus_scala: Refreshing state... [id=4973599:quarkus-scala3]
github_team_repository.quarkus_lucene: Refreshing state... [id=4572442:quarkus-lucene]
github_team_membership.quarkus_lucene["gustavocoding"]: Refreshing state... [id=4572442:gustavocoding]
github_team_repository.quarkus_rsocket: Refreshing state... [id=4628116:quarkus-rsocket]
github_team_membership.quarkus_rsocket["dufoli"]: Refreshing state... [id=4628116:dufoli]
github_team_repository.quarkus_mybatis: Refreshing state... [id=4163389:quarkus-mybatis]
github_team_membership.quarkus_mybatis["zhfeng"]: Refreshing state... [id=4163389:zhfeng]
github_team_membership.quarkus_mybatis["zohar-soul"]: Refreshing state... [id=4163389:zohar-soul]
github_team_repository.quarkus_hivemq_client: Refreshing state... [id=4651319:quarkus-hivemq-client]
github_team_membership.quarkus_hivemq_client["masini"]: Refreshing state... [id=4651319:masini]
github_team_membership.quarkus_jjwt_jackson["gsmet"]: Refreshing state... [id=4698127:gsmet]
github_team_repository.quarkus_jjwt_jackson: Refreshing state... [id=4698127:quarkus-jjwt-jackson]
github_team_repository.quarkus_reactive_messaging_http: Refreshing state... [id=5290863:quarkus-reactive-messaging-http]
github_team_membership.quarkus_reactive_messaging_http["michalszynkiewicz"]: Refreshing state... [id=5290863:michalszynkiewicz]
github_team_membership.quarkus_jsch["gastaldi"]: Refreshing state... [id=5418783:gastaldi]
github_team_repository.quarkus_jsch: Refreshing state... [id=5418783:quarkus-jsch]
github_team_repository.quarkus_unleash: Refreshing state... [id=4478763:quarkus-unleash]
github_team_membership.quarkus_unleash["andrejpetras"]: Refreshing state... [id=4478763:andrejpetras]
github_team_repository.quarkus_apicurio_registry_client: Refreshing state... [id=4359832:quarkus-apicurio-registry-client]
github_team_membership.quarkus_apicurio_registry_client["famartinrh"]: Refreshing state... [id=4359832:famartinrh]
github_branch_default.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_team_repository.quarkus_vault: Refreshing state... [id=5438750:quarkus-vault]
github_team_repository.quarkus_jgrapht: Refreshing state... [id=4691584:quarkus-jgrapht]
github_team_membership.quarkus_vault["sberyozkin"]: Refreshing state... [id=5438750:sberyozkin]
github_team_membership.quarkus_vault["vsevel"]: Refreshing state... [id=5438750:vsevel]
github_team_membership.quarkus_jgrapht["rsvoboda"]: Refreshing state... [id=4691584:rsvoboda]
github_team_repository.quarkus_maven_resolver: Refreshing state... [id=5330694:quarkus-maven-resolver]
github_team_membership.quarkus_maven_resolver["aloubyansky"]: Refreshing state... [id=5330694:aloubyansky]
github_team_membership.quarkus_maven_resolver["gastaldi"]: Refreshing state... [id=5330694:gastaldi]
github_team_membership.quarkus_elasticsearch_reactive["loicmathieu"]: Refreshing state... [id=4941463:loicmathieu]
github_team_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463:quarkus-elasticsearch-reactive]
github_team_membership.quarkus_cxf["Dufgui"]: Refreshing state... [id=4221025:Dufgui]
github_team_membership.quarkus_cxf["dufoli"]: Refreshing state... [id=4221025:dufoli]
github_team_membership.quarkus_cxf["shumonsharif"]: Refreshing state... [id=4221025:shumonsharif]
github_team_repository.quarkus_micrometer_registry: Refreshing state... [id=4331393:quarkus-micrometer-registry]
github_team_repository.quarkus_mockk: Refreshing state... [id=4479092:quarkus-mockk]
github_team_membership.quarkus_mockk["glefloch"]: Refreshing state... [id=4479092:glefloch]
github_team_membership.quarkus_operator_sdk["metacosm"]: Refreshing state... [id=4585468:metacosm]
github_team_membership.quarkus_micrometer_registry["ebullient"]: Refreshing state... [id=4331393:ebullient]
github_team_membership.quarkus_micrometer_registry["jonatan-ivanov"]: Refreshing state... [id=4331393:jonatan-ivanov]
github_team_repository.quarkus_xmlsec: Refreshing state... [id=5249540:quarkus-xmlsec]
github_team_membership.quarkus_micrometer_registry["kenfinnigan"]: Refreshing state... [id=4331393:kenfinnigan]
github_team_membership.quarkus_xmlsec["gastaldi"]: Refreshing state... [id=5249540:gastaldi]
github_team_membership.quarkus_xmlsec["martinffx"]: Refreshing state... [id=5249540:martinffx]
github_team_repository.quarkus_neo4j: Refreshing state... [id=5438745:quarkus-neo4j]
github_team_membership.quarkus_neo4j["michael-simons"]: Refreshing state... [id=5438745:michael-simons]
github_team_membership.quarkus_qson["patriot1burke"]: Refreshing state... [id=5258394:patriot1burke]
github_team_repository.quarkus_qson: Refreshing state... [id=5258394:quarkus-qson]
github_team_membership.quarkus_logging_json["SlyngDK"]: Refreshing state... [id=4136031:SlyngDK]
github_team_repository.quarkus_logging_json: Refreshing state... [id=4136031:quarkus-logging-json]
github_team_repository.quarkus_freemarker: Refreshing state... [id=4139356:quarkus-freemarker]
github_team_repository.quarkus_operator_sdk: Refreshing state... [id=4585468:quarkus-operator-sdk]
github_team_membership.quarkus_minio["jtama"]: Refreshing state... [id=4257600:jtama]
github_team_repository.quarkus_minio: Refreshing state... [id=4257600:quarkus-minio]
github_team_membership.quarkus_freemarker["vsevel"]: Refreshing state... [id=4139356:vsevel]
github_team_repository.quarkus_logging_manager: Refreshing state... [id=4193789:quarkus-logging-manager]
github_team_membership.quarkus_logging_manager["phillip-kruger"]: Refreshing state... [id=4193789:phillip-kruger]
github_team_membership.quarkus_logging_manager["oscarfh"]: Refreshing state... [id=4193789:oscarfh]
github_team_repository.quarkus_cxf: Refreshing state... [id=4221025:quarkus-cxf]
github_team_membership.quarkus_jgit["gastaldi"]: Refreshing state... [id=5418782:gastaldi]
github_team_repository.quarkus_datadog_opentracing: Refreshing state... [id=4759562:quarkus-datadog-opentracing]
github_team_membership.quarkus_datadog_opentracing["nicolas-vivot"]: Refreshing state... [id=4759562:nicolas-vivot]
github_team_repository.quarkus_jgit: Refreshing state... [id=5418782:quarkus-jgit]
github_team_repository.quarkus_microprofile: Refreshing state... [id=5018652:quarkus-microprofile]
github_team_membership.quarkus_microprofile["radcortez"]: Refreshing state... [id=5018652:radcortez]
github_team_repository.quarkus_cucumber: Refreshing state... [id=5020733:quarkus-cucumber]
github_team_membership.quarkus_cucumber["stuartwdouglas"]: Refreshing state... [id=5020733:stuartwdouglas]
github_team_membership.quarkus_cucumber["christophd"]: Refreshing state... [id=5020733:christophd]
github_team_membership.quarkus_logging_sentry["ia3andy"]: Refreshing state... [id=5300000:ia3andy]
github_team_membership.quarkus_logging_sentry["gsmet"]: Refreshing state... [id=5300000:gsmet]
github_team_repository.quarkus_logging_sentry: Refreshing state... [id=5300000:quarkus-logging-sentry]
github_team_membership.quarkus_jberet["radcortez"]: Refreshing state... [id=4130738:radcortez]
github_team_repository.quarkus_hibernate_types: Refreshing state... [id=4427586:quarkus-hibernate-types]
github_team_membership.quarkus_hibernate_types["andrejpetras"]: Refreshing state... [id=4427586:andrejpetras]
github_team_repository.quarkus_jberet: Refreshing state... [id=4130738:quarkus-jberet]
github_team_membership.quarkus_jackson_jq["ricardozanini"]: Refreshing state... [id=5182252:ricardozanini]
github_team_membership.quarkus_jackson_jq["aloubyansky"]: Refreshing state... [id=5182252:aloubyansky]
github_team_repository.quarkus_jackson_jq: Refreshing state... [id=5182252:quarkus-jackson-jq]
github_team_repository.quarkus_tekton_client: Refreshing state... [id=4429729:quarkus-tekton-client]
github_team_membership.quarkus_tekton_client["goldmann"]: Refreshing state... [id=4429729:goldmann]
github_team_repository.quarkus_consul_config: Refreshing state... [id=5438744:quarkus-consul-config]
github_team_membership.quarkus_consul_config["geoand"]: Refreshing state... [id=5438744:geoand]
github_team_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628:quarkus-shardingsphere-jdbc]
github_team_membership.quarkus_shardingsphere_jdbc["zhfeng"]: Refreshing state... [id=5330628:zhfeng]
github_team_membership.quarkus_google_cloud_services["loicmathieu"]: Refreshing state... [id=4133757:loicmathieu]
github_team_repository.quarkus_google_cloud_services: Refreshing state... [id=4133757:quarkus-google-cloud-services]
github_team_membership.quarkus_amazon_services["marcinczeczko"]: Refreshing state... [id=5438747:marcinczeczko]
github_team_repository.quarkus_amazon_services: Refreshing state... [id=5438747:quarkus-amazon-services]
github_team_repository.quarkus_amazon_alexa: Refreshing state... [id=5438751:quarkus-amazon-alexa]
github_team_membership.quarkus_amazon_alexa["oztimpower"]: Refreshing state... [id=5438751:oztimpower]
github_team_membership.quarkus_config_extensions["radcortez"]: Refreshing state... [id=4679791:radcortez]
github_team_membership.quarkus_jooq["angrymango"]: Refreshing state... [id=4499064:angrymango]
github_team_repository.quarkus_jooq: Refreshing state... [id=4499064:quarkus-jooq]
github_team_repository.quarkus_config_extensions: Refreshing state... [id=4679791:quarkus-config-extensions]
github_team_membership.quarkus_logging_logback["stuartwdouglas"]: Refreshing state... [id=4934360:stuartwdouglas]
github_team_membership.quarkus_opencv["gsmet"]: Refreshing state... [id=5330519:gsmet]
github_team_repository.quarkus_logging_logback: Refreshing state... [id=4934360:quarkus-logging-logback]
github_team_repository.quarkus_opencv: Refreshing state... [id=5330519:quarkus-opencv]
github_team_repository.quarkus_kerberos: Refreshing state... [id=5330599:quarkus-kerberos]
github_team_membership.quarkus_kerberos["stuartwdouglas"]: Refreshing state... [id=5330599:stuartwdouglas]
github_team_repository.quarkus_zeebe: Refreshing state... [id=5333665:quarkus-zeebe]
github_team_membership.quarkus_kerberos["cescoffier"]: Refreshing state... [id=5330599:cescoffier]
github_team_membership.quarkus_kerberos["sberyozkin"]: Refreshing state... [id=5330599:sberyozkin]
github_team_membership.quarkus_zeebe["andrejpetras"]: Refreshing state... [id=5333665:andrejpetras]
github_team_membership.quarkus_rabbitmq_client["bpasson"]: Refreshing state... [id=4454281:bpasson]
github_team_repository.quarkus_rabbitmq_client: Refreshing state... [id=4454281:quarkus-rabbitmq-client]
github_team_membership.quarkus_tika["sberyozkin"]: Refreshing state... [id=5317008:sberyozkin]
github_team_repository.quarkus_tika: Refreshing state... [id=5317008:quarkus-tika]
github_team_repository.quarkus_morphia: Refreshing state... [id=4994632:quarkus-morphia]
github_team_membership.quarkus_morphia["evanchooly"]: Refreshing state... [id=4994632:evanchooly]
github_team_repository.quarkus_github_api: Refreshing state... [id=5327486:quarkus-github-api]
github_team_membership.quarkus_github_api["gsmet"]: Refreshing state... [id=5327486:gsmet]
github_team_membership.quarkus_github_api["quarkiversebot"]: Refreshing state... [id=5327486:quarkiversebot]
github_team_repository.quarkus_logging_splunk: Refreshing state... [id=4611522:quarkus-logging-splunk]
github_team_membership.quarkus_logging_splunk["vietk"]: Refreshing state... [id=4611522:vietk]
github_team_membership.quarkus_logging_splunk["rquinio1A"]: Refreshing state... [id=4611522:rquinio1A]
github_team_repository.quarkus_univocity_parsers: Refreshing state... [id=4707008:quarkus-univocity-parsers]
github_team_membership.quarkus_univocity_parsers["aruffie"]: Refreshing state... [id=4707008:aruffie]
github_team_membership.quarkus_github_app["quarkiversebot"]: Refreshing state... [id=5327479:quarkiversebot]
github_team_membership.quarkus_github_app["gsmet"]: Refreshing state... [id=5327479:gsmet]
github_team_repository.quarkus_github_app: Refreshing state... [id=5327479:quarkus-github-app]
github_team_repository.quarkus_jna: Refreshing state... [id=4257639:quarkus-jna]
github_team_membership.quarkus_jna["dufoli"]: Refreshing state... [id=4257639:dufoli]
github_team_membership.quarkus_prettytime["gastaldi"]: Refreshing state... [id=4612233:gastaldi]
github_team_repository.quarkus_prettytime: Refreshing state... [id=4612233:quarkus-prettytime]
github_team_repository.quarkus_artemis: Refreshing state... [id=5438742:quarkus-artemis]
github_team_membership.quarkus_artemis["middagj"]: Refreshing state... [id=5438742:middagj]
github_branch_default.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_branch_default.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.quarkus_vault has been changed
  ~ resource "github_team_repository" "quarkus_vault" {
      ~ etag       = "W/\"858fdcae7b280ee910ebc8d6f2071136bc43d9fc811cccc9c22a3501f4aafd3d\"" -> "W/\"ec58a0e0fb788e7421f52b8ec0a07740de74ebb0de03637337fb793806f644d6\""
        id         = "5438750:quarkus-vault"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_mybatis has been changed
  ~ resource "github_repository" "quarkus_mybatis" {
      ~ etag                   = "W/\"5d709d970b1f03451dd89d8cef33fd866cae54281a074b498096cfd70aa0450d\"" -> "W/\"d9db1eca96088859548dfa30386e41904c0e1441534626a39231c5c2ca0743c8\""
        id                     = "quarkus-mybatis"
        name                   = "quarkus-mybatis"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_artemis has been changed
  ~ resource "github_team_repository" "quarkus_artemis" {
      ~ etag       = "W/\"45b6fdfdc7d2ed82dbb699d9f457215de1d3f4028933ed731a83d809ca0dc696\"" -> "W/\"0b5784af4f8f387b8895980cbd0d87aea64f35ff332d4d81422ec5f57c440b38\""
        id         = "5438742:quarkus-artemis"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_mybatis has been changed
  ~ resource "github_team_repository" "quarkus_mybatis" {
      ~ etag       = "W/\"ed28deb58306b8f7fe6c7f45da1350126b07a0ef4956e463d449852c39b7cb3c\"" -> "W/\"b94a3bd610b48c2316f2f1e9cb909a0a4d80e9494d0934b0ebc91ec88cd99c4a\""
        id         = "4163389:quarkus-mybatis"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_artemis has been changed
  ~ resource "github_repository" "quarkus_artemis" {
      ~ etag                   = "W/\"9f39d097e419d5aa751fd3047921692df4196f5594639116cb55e80201e8786a\"" -> "W/\"6d0ec95d131e17ffcf798d7007aebbb065155f7637894a0fe3fa4c60b90ef92c\""
        id                     = "quarkus-artemis"
        name                   = "quarkus-artemis"
        # (24 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_amazon_services has been changed
  ~ resource "github_team_repository" "quarkus_amazon_services" {
      ~ etag       = "W/\"cb22943497be5eb1c2d5ba3bea0c6a067522bd010b4957720dbff8d93c9ad1b4\"" -> "W/\"95f450e8f6ca896e2a880cf21fab0ec97aabba247f0266dd4098ad94da0ca48d\""
        id         = "5438747:quarkus-amazon-services"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_logging_logback has been changed
  ~ resource "github_team_repository" "quarkus_logging_logback" {
      ~ etag       = "W/\"987e3272b4f275a13dca38ccfc0f2db78d80b1057daa57ee211f78d615c725c3\"" -> "W/\"5523e63d2134da84c98ed4872f4f1d55e601b0f9ba765145d99d1ddab92c9188\""
        id         = "4934360:quarkus-logging-logback"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_vault has been changed
  ~ resource "github_repository" "quarkus_vault" {
      ~ etag                   = "W/\"73184491d19c35fedc73fe5d62ba991b71f90d13f417ed8f58a26b07828102e3\"" -> "W/\"cc00f9b1bb3b599ac1c413d9ceb8414d84a9286c39e1acd0a1d027c498b7906a\""
        id                     = "quarkus-vault"
        name                   = "quarkus-vault"
        # (24 unchanged attributes hidden)
    }
  # github_repository.quarkus_amazon_services has been changed
  ~ resource "github_repository" "quarkus_amazon_services" {
      ~ etag                   = "W/\"f75a1e94596e8e050f901b8ddee6217d1a6f238331ac7f2e492860dd90834dd2\"" -> "W/\"0e9dc1a6aba94dc1619a8a7efd229d2fbea455cecca9d7a684dd8860880b60ee\""
        id                     = "quarkus-amazon-services"
        name                   = "quarkus-amazon-services"
        # (24 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.quarkus_hibernate_search_extras will be created
  + resource "github_repository" "quarkus_hibernate_search_extras" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Quarkus Hibernate Search Extras extensions"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "quarkus-hibernate-search-extras"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "quarkus-extension",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_team.quarkus_hibernate_search_extras will be created
  + resource "github_team" "quarkus_hibernate_search_extras" {
      + create_default_maintainer = false
      + description               = "Quarkiverse team for the Hibernate Search Extras extensions"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-hibernate-search-extras"
      + node_id                   = (known after apply)
      + parent_team_id            = 5344029
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_hibernate_search_extras["yrodiere"] will be created
  + resource "github_team_membership" "quarkus_hibernate_search_extras" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "yrodiere"
    }

  # github_team_repository.quarkus_hibernate_search_extras will be created
  + resource "github_team_repository" "quarkus_hibernate_search_extras" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-hibernate-search-extras"
      + team_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @gsmet, Action: `pull_request`*